from wcwidth import wcswidth

class Monster:
    def spider(self):
        art = r"""⠀⠀⠀⠀⠀⠀⢀⣤⣤⣰⣤⠀⠀⣄⠀⠀⠀⠀⠀⠀⠀⢀⡄⠀⣰⣟⣴⣦⣤⡀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⣠⣾⡿⣧⡾⠿⢎⢣⣠⣿⡄⠀⣠⣤⣦⣄⠀⣸⣷⡼⣡⠟⢻⣆⠻⢿⣦⡀⠀⠀⠀
⠀⠀⢀⣼⠟⢁⣸⠋⠀⠀⠘⣿⣿⣿⡼⣸⣿⣿⣿⣿⣤⣻⣿⣯⠋⠀⠀⠹⡆⠀⠙⢷⡄⠀⠀
⢀⢠⡞⠁⠀⠘⣇⠀⠀⠀⢀⡿⣿⠿⣿⣿⣿⣿⣿⣿⣿⠿⢋⡿⡇⠀⠀⢀⡟⠀⠀⠀⢻⡀⠀
⡼⢿⡁⠀⠀⠀⢻⠀⠀⠀⢰⠁⠹⠀⢀⠜⣙⣿⣟⡛⢄⠀⢸⠃⢉⠀⠀⢸⠃⠀⠀⠀⢀⡿⢧
⠀⢸⣷⠀⠀⠀⠈⠇⠀⠀⡾⠀⠀⠀⠈⠑⠚⠋⠋⠐⠈⠀⠈⠀⢸⡆⠀⠎⠀⠀⠀⠀⣾⡇⠀
⠀⠀⢿⠀⠀⠀⠀⠀⠀⠀⢼⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢼⠂⠀⠀⠀⠀⠀⠀⡿⠀⠀
⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"""

        #각 줄을 리스트로 변환 후 최대 길이 계산
        lines = art.strip('\n').split('\n')
        max_len = max(wcswidth(line) for line in lines)

        #위 아래를 '='로 감싸기
        border = '⠒' * max_len

        # 줄들을 조립
        result = f"{border}\n" + '\n'.join(lines) + f"\n{border}"
        return result

